# ExternalResourceUIService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ExternalResourceUIService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ExternalResourceUIService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExternalResourceUIService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ExternalResourceUIService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace